## staging: elasticache
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 16 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                      |
|--------|-------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[0]`           |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[1]`           |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[2]`           |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[0]` |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[1]` |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[2]` |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[0]`    |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[1]`    |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[2]`    |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[0]`     |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[1]`     |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[2]`     |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[0]`         |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[1]`         |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[2]`         |
|        | `aws_elasticache_replication_group.elasticache_queue_cache[0]`                |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/16176482786).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
17:51:45.449 STDOUT terraform:   + create
17:51:45.449 STDOUT terraform: Terraform will perform the following actions:
17:51:45.449 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[0] will be created
17:51:45.449 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_cpu_warning" {
17:51:45.449 STDOUT terraform:       + actions_enabled                       = true
17:51:45.449 STDOUT terraform:       + alarm_actions                         = [
17:51:45.450 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.450 STDOUT terraform:         ]
17:51:45.450 STDOUT terraform:       + alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute "
17:51:45.450 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-cpu-warning-CacheCluster001CPUUtilization"
17:51:45.450 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.450 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.450 STDOUT terraform:       + dimensions                            = {
17:51:45.450 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-001"
17:51:45.450 STDOUT terraform:         }
17:51:45.450 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.450 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.450 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.450 STDOUT terraform:       + metric_name                           = "CPUUtilization"
17:51:45.450 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.450 STDOUT terraform:       + ok_actions                            = [
17:51:45.450 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.450 STDOUT terraform:         ]
17:51:45.450 STDOUT terraform:       + period                                = 60
17:51:45.450 STDOUT terraform:       + statistic                             = "Average"
17:51:45.450 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.450 STDOUT terraform:       + threshold                             = 70
17:51:45.450 STDOUT terraform:       + treat_missing_data                    = "breaching"
17:51:45.450 STDOUT terraform:     }
17:51:45.450 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[1] will be created
17:51:45.451 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_cpu_warning" {
17:51:45.451 STDOUT terraform:       + actions_enabled                       = true
17:51:45.451 STDOUT terraform:       + alarm_actions                         = [
17:51:45.451 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.451 STDOUT terraform:         ]
17:51:45.451 STDOUT terraform:       + alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute "
17:51:45.451 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-cpu-warning-CacheCluster002CPUUtilization"
17:51:45.451 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.451 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.451 STDOUT terraform:       + dimensions                            = {
17:51:45.451 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-002"
17:51:45.451 STDOUT terraform:         }
17:51:45.451 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.451 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.451 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.451 STDOUT terraform:       + metric_name                           = "CPUUtilization"
17:51:45.451 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.451 STDOUT terraform:       + ok_actions                            = [
17:51:45.451 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.451 STDOUT terraform:         ]
17:51:45.451 STDOUT terraform:       + period                                = 60
17:51:45.451 STDOUT terraform:       + statistic                             = "Average"
17:51:45.451 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.451 STDOUT terraform:       + threshold                             = 70
17:51:45.451 STDOUT terraform:       + treat_missing_data                    = "breaching"
17:51:45.452 STDOUT terraform:     }
17:51:45.452 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[2] will be created
17:51:45.452 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_cpu_warning" {
17:51:45.452 STDOUT terraform:       + actions_enabled                       = true
17:51:45.452 STDOUT terraform:       + alarm_actions                         = [
17:51:45.452 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.452 STDOUT terraform:         ]
17:51:45.452 STDOUT terraform:       + alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute "
17:51:45.452 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-cpu-warning-CacheCluster003CPUUtilization"
17:51:45.452 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.452 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.452 STDOUT terraform:       + dimensions                            = {
17:51:45.452 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-003"
17:51:45.452 STDOUT terraform:         }
17:51:45.452 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.452 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.452 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.452 STDOUT terraform:       + metric_name                           = "CPUUtilization"
17:51:45.452 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.452 STDOUT terraform:       + ok_actions                            = [
17:51:45.452 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.452 STDOUT terraform:         ]
17:51:45.452 STDOUT terraform:       + period                                = 60
17:51:45.452 STDOUT terraform:       + statistic                             = "Average"
17:51:45.453 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.453 STDOUT terraform:       + threshold                             = 70
17:51:45.453 STDOUT terraform:       + treat_missing_data                    = "breaching"
17:51:45.453 STDOUT terraform:     }
17:51:45.453 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[0] will be created
17:51:45.453 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_connection_warning" {
17:51:45.453 STDOUT terraform:       + actions_enabled                       = true
17:51:45.453 STDOUT terraform:       + alarm_actions                         = [
17:51:45.453 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.453 STDOUT terraform:         ]
17:51:45.453 STDOUT terraform:       + alarm_description                     = "Average Number of Connections on Redis ElastiCache >= 1000 connections during 1 minute"
17:51:45.453 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-connection-warning-CacheCluster001"
17:51:45.453 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.453 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.453 STDOUT terraform:       + dimensions                            = {
17:51:45.453 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-001"
17:51:45.453 STDOUT terraform:         }
17:51:45.453 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.453 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.453 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.453 STDOUT terraform:       + metric_name                           = "CurrConnections"
17:51:45.453 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.453 STDOUT terraform:       + ok_actions                            = [
17:51:45.454 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.454 STDOUT terraform:         ]
17:51:45.454 STDOUT terraform:       + period                                = 60
17:51:45.454 STDOUT terraform:       + statistic                             = "Average"
17:51:45.454 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.454 STDOUT terraform:       + threshold                             = 1000
17:51:45.454 STDOUT terraform:       + treat_missing_data                    = "missing"
17:51:45.454 STDOUT terraform:     }
17:51:45.454 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[1] will be created
17:51:45.454 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_connection_warning" {
17:51:45.454 STDOUT terraform:       + actions_enabled                       = true
17:51:45.454 STDOUT terraform:       + alarm_actions                         = [
17:51:45.454 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.454 STDOUT terraform:         ]
17:51:45.454 STDOUT terraform:       + alarm_description                     = "Average Number of Connections on Redis ElastiCache >= 1000 connections during 1 minute"
17:51:45.454 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-connection-warning-CacheCluster002"
17:51:45.454 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.454 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.454 STDOUT terraform:       + dimensions                            = {
17:51:45.454 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-002"
17:51:45.454 STDOUT terraform:         }
17:51:45.454 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.454 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.454 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.454 STDOUT terraform:       + metric_name                           = "CurrConnections"
17:51:45.454 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.454 STDOUT terraform:       + ok_actions                            = [
17:51:45.454 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.454 STDOUT terraform:         ]
17:51:45.455 STDOUT terraform:       + period                                = 60
17:51:45.455 STDOUT terraform:       + statistic                             = "Average"
17:51:45.455 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.455 STDOUT terraform:       + threshold                             = 1000
17:51:45.455 STDOUT terraform:       + treat_missing_data                    = "missing"
17:51:45.455 STDOUT terraform:     }
17:51:45.455 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[2] will be created
17:51:45.455 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_connection_warning" {
17:51:45.455 STDOUT terraform:       + actions_enabled                       = true
17:51:45.455 STDOUT terraform:       + alarm_actions                         = [
17:51:45.455 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.455 STDOUT terraform:         ]
17:51:45.455 STDOUT terraform:       + alarm_description                     = "Average Number of Connections on Redis ElastiCache >= 1000 connections during 1 minute"
17:51:45.455 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-connection-warning-CacheCluster003"
17:51:45.455 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.455 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.455 STDOUT terraform:       + dimensions                            = {
17:51:45.455 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-003"
17:51:45.455 STDOUT terraform:         }
17:51:45.455 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.455 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.455 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.455 STDOUT terraform:       + metric_name                           = "CurrConnections"
17:51:45.455 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.455 STDOUT terraform:       + ok_actions                            = [
17:51:45.455 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.455 STDOUT terraform:         ]
17:51:45.455 STDOUT terraform:       + period                                = 60
17:51:45.455 STDOUT terraform:       + statistic                             = "Average"
17:51:45.455 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.455 STDOUT terraform:       + threshold                             = 1000
17:51:45.455 STDOUT terraform:       + treat_missing_data                    = "missing"
17:51:45.455 STDOUT terraform:     }
17:51:45.455 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[0] will be created
17:51:45.455 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_critical" {
17:51:45.456 STDOUT terraform:       + actions_enabled                       = true
17:51:45.456 STDOUT terraform:       + alarm_actions                         = [
17:51:45.456 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
17:51:45.456 STDOUT terraform:         ]
17:51:45.456 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
17:51:45.456 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-critical-CacheCluster001"
17:51:45.456 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.456 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.456 STDOUT terraform:       + dimensions                            = {
17:51:45.456 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-001"
17:51:45.456 STDOUT terraform:         }
17:51:45.456 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.456 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.456 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.456 STDOUT terraform:       + metric_name                           = "DatabaseMemoryUsagePercentage"
17:51:45.456 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.456 STDOUT terraform:       + ok_actions                            = [
17:51:45.456 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
17:51:45.456 STDOUT terraform:         ]
17:51:45.456 STDOUT terraform:       + period                                = 60
17:51:45.456 STDOUT terraform:       + statistic                             = "Average"
17:51:45.456 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.456 STDOUT terraform:       + threshold                             = 85
17:51:45.456 STDOUT terraform:       + treat_missing_data                    = "missing"
17:51:45.456 STDOUT terraform:     }
17:51:45.456 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[1] will be created
17:51:45.456 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_critical" {
17:51:45.456 STDOUT terraform:       + actions_enabled                       = true
17:51:45.456 STDOUT terraform:       + alarm_actions                         = [
17:51:45.456 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
17:51:45.456 STDOUT terraform:         ]
17:51:45.456 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
17:51:45.457 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-critical-CacheCluster002"
17:51:45.457 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.457 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.457 STDOUT terraform:       + dimensions                            = {
17:51:45.457 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-002"
17:51:45.457 STDOUT terraform:         }
17:51:45.457 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.457 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.457 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.457 STDOUT terraform:       + metric_name                           = "DatabaseMemoryUsagePercentage"
17:51:45.457 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.457 STDOUT terraform:       + ok_actions                            = [
17:51:45.457 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
17:51:45.457 STDOUT terraform:         ]
17:51:45.457 STDOUT terraform:       + period                                = 60
17:51:45.457 STDOUT terraform:       + statistic                             = "Average"
17:51:45.457 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.457 STDOUT terraform:       + threshold                             = 85
17:51:45.457 STDOUT terraform:       + treat_missing_data                    = "missing"
17:51:45.457 STDOUT terraform:     }
17:51:45.457 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[2] will be created
17:51:45.457 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_critical" {
17:51:45.457 STDOUT terraform:       + actions_enabled                       = true
17:51:45.457 STDOUT terraform:       + alarm_actions                         = [
17:51:45.457 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
17:51:45.457 STDOUT terraform:         ]
17:51:45.457 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
17:51:45.457 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-critical-CacheCluster003"
17:51:45.457 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.457 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.457 STDOUT terraform:       + dimensions                            = {
17:51:45.458 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-003"
17:51:45.458 STDOUT terraform:         }
17:51:45.458 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.458 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.458 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.458 STDOUT terraform:       + metric_name                           = "DatabaseMemoryUsagePercentage"
17:51:45.458 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.458 STDOUT terraform:       + ok_actions                            = [
17:51:45.458 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
17:51:45.458 STDOUT terraform:         ]
17:51:45.458 STDOUT terraform:       + period                                = 60
17:51:45.458 STDOUT terraform:       + statistic                             = "Average"
17:51:45.458 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.458 STDOUT terraform:       + threshold                             = 85
17:51:45.458 STDOUT terraform:       + treat_missing_data                    = "missing"
17:51:45.458 STDOUT terraform:     }
17:51:45.458 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[0] will be created
17:51:45.458 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_warning" {
17:51:45.458 STDOUT terraform:       + actions_enabled                       = true
17:51:45.458 STDOUT terraform:       + alarm_actions                         = [
17:51:45.458 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.458 STDOUT terraform:         ]
17:51:45.458 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 60% during 1 minute"
17:51:45.458 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-warning-CacheCluster001"
17:51:45.458 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.458 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.458 STDOUT terraform:       + dimensions                            = {
17:51:45.458 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-001"
17:51:45.458 STDOUT terraform:         }
17:51:45.458 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.458 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.458 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.458 STDOUT terraform:       + metric_name                           = "DatabaseMemoryUsagePercentage"
17:51:45.458 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.459 STDOUT terraform:       + ok_actions                            = [
17:51:45.459 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.459 STDOUT terraform:         ]
17:51:45.459 STDOUT terraform:       + period                                = 60
17:51:45.459 STDOUT terraform:       + statistic                             = "Average"
17:51:45.459 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.459 STDOUT terraform:       + threshold                             = 60
17:51:45.459 STDOUT terraform:       + treat_missing_data                    = "missing"
17:51:45.459 STDOUT terraform:     }
17:51:45.459 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[1] will be created
17:51:45.459 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_warning" {
17:51:45.459 STDOUT terraform:       + actions_enabled                       = true
17:51:45.459 STDOUT terraform:       + alarm_actions                         = [
17:51:45.459 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.459 STDOUT terraform:         ]
17:51:45.459 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 60% during 1 minute"
17:51:45.459 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-warning-CacheCluster002"
17:51:45.459 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.459 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.459 STDOUT terraform:       + dimensions                            = {
17:51:45.459 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-002"
17:51:45.459 STDOUT terraform:         }
17:51:45.459 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.459 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.459 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.459 STDOUT terraform:       + metric_name                           = "DatabaseMemoryUsagePercentage"
17:51:45.459 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.459 STDOUT terraform:       + ok_actions                            = [
17:51:45.459 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.459 STDOUT terraform:         ]
17:51:45.459 STDOUT terraform:       + period                                = 60
17:51:45.459 STDOUT terraform:       + statistic                             = "Average"
17:51:45.459 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.459 STDOUT terraform:       + threshold                             = 60
17:51:45.460 STDOUT terraform:       + treat_missing_data                    = "missing"
17:51:45.460 STDOUT terraform:     }
17:51:45.460 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[2] will be created
17:51:45.460 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_warning" {
17:51:45.460 STDOUT terraform:       + actions_enabled                       = true
17:51:45.460 STDOUT terraform:       + alarm_actions                         = [
17:51:45.460 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.460 STDOUT terraform:         ]
17:51:45.460 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 60% during 1 minute"
17:51:45.460 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-warning-CacheCluster003"
17:51:45.460 STDOUT terraform:       + arn                                   = (known after apply)
17:51:45.460 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
17:51:45.460 STDOUT terraform:       + dimensions                            = {
17:51:45.460 STDOUT terraform:           + "CacheClusterId" = "notify-staging-cluster-cache-az-003"
17:51:45.460 STDOUT terraform:         }
17:51:45.460 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:51:45.460 STDOUT terraform:       + evaluation_periods                    = 1
17:51:45.460 STDOUT terraform:       + id                                    = (known after apply)
17:51:45.460 STDOUT terraform:       + metric_name                           = "DatabaseMemoryUsagePercentage"
17:51:45.460 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
17:51:45.460 STDOUT terraform:       + ok_actions                            = [
17:51:45.460 STDOUT terraform:           + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
17:51:45.460 STDOUT terraform:         ]
17:51:45.460 STDOUT terraform:       + period                                = 60
17:51:45.460 STDOUT terraform:       + statistic                             = "Average"
17:51:45.460 STDOUT terraform:       + tags_all                              = (known after apply)
17:51:45.460 STDOUT terraform:       + threshold                             = 60
17:51:45.460 STDOUT terraform:       + treat_missing_data                    = "missing"
17:51:45.460 STDOUT terraform:     }
17:51:45.460 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[0] will be created
17:51:45.460 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_medium_cpu_warning" {
17:51:45.460 STDOUT terraform:       + actions_enabled                       = true
17:51:45.460 STDOUT terraform:       + alarm_actions                         = [
17:51:45.460 STDOUT terraform:           +...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.elasticache_queue_cache_engine_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.elasticache_queue_cache_slow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-elasticache-engine-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-elasticache-slow-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.redis-batch-saving"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[1]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
